Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: འཕགས་པ་འོད་ཟེར་ཀུན་དུ་བཀྱེ་བ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Teaching on the Effulgence of Light

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཕུང་པོའི་རི་ལ། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་རང་དབང་ཆེན་པོ་ཐོབ་པ་ལྔ་བརྒྱ་དང་། གཞན་ཡང་ཚེ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་སོགས་པ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུ་དང་། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སོགས་པ་ཁྲག་ཁྲིག་ཕྲག་བཞི་བཅུ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing in Rājagṛha at Vulture Peak, together with a great saṅgha of five hundred monks who had all attained great independence, eight hundred billion bodhisattva great beings with only one birth remaining and led by Maitreya, and four hundred billion bodhisattva great beings led by Mañjuśrīkumārabhūta.

source: དེའི་ཚེ་འཁོར་འདུས་པ་དེ་ཉིད་དུ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ཞེས་བྱ་བ་ཞིག་འདུས་པར་གྱུར་པ་དེ་འདུག་པའི་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། གུས་པས་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Present in the retinue at that time was Candraprabhakumārabhūta. He had been seated in the assembly, but he now rose from his seat, arranged his shawl over one shoulder, knelt on his right knee, and prostrated at the feet of the Blessed One.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་སྔོན་ཕྲིན་ལས་ཅི་ཞིག་མཛད་ན་འདི་ལྟར་རྣམ་པར་ངེས་པའི་འོད་ཟེར་དང་། ཡོངས་སུ་སྡུད་པའི་འོད་ཟེར་དང་། ཀུན་ནས་སློང་བའི་འོད་ཟེར་དང་། རབ་ཏུ་སྟོན་པའི་འོད་ཟེར་དང་། ཁ་དོག་སྣ་ཚོགས་ཀྱི་འོད་ཟེར་དང་། ཁ་དོག་འདྲེས་པ་མ་མཆིས་པའི་འོད་ཟེར་དང་། རྒྱ་ཆུང་ངུའི་འོད་ཟེར་དང་། རྒྱ་ཆེན་པོའི་འོད་ཟེར་དང་། རྣམ་པར་དག་པའི་འོད་ཟེར་དང་། ཤིན་ཏུ་རྣམ་པར་དག་པའི་འོད་ཟེར་དང་། དྲི་མ་མ་མཆིས་པའི་འོད་ཟེར་དང་། ཤིན་ཏུ་དྲི་མ་མ་མཆིས་པའི་འོད་ཟེར་དང་། དྲི་མ་དང་བྲལ་བའི་འོད་ཟེར་དང་། རིམ་གྱིས་འཕེལ་བའི་འོད་ཟེར་དང་། གསལ་བའི་འོད་ཟེར་དང་། ཤིན་ཏུ་གསལ་བའི་འོད་ཟེར་དང་། མཐའ་མ་མཆིས་པའི་འོད་ཟེར་དང་། ཤིན་ཏུ་མཐའ་མ་མཆིས་པའི་འོད་ཟེར་དང་། ཚད་མ་མཆིས་པའི་འོད་ཟེར་དང་། ཤིན་ཏུ་ཚད་མ་མཆིས་པའི་འོད་ཟེར་དང་། གྲངས་ཀྱི་ཚད་མ་མཆིས་པའི་འོད་ཟེར་དང་། ཤིན་ཏུ་གྲངས་ཀྱི་ཚད་མ་མཆིས་པའི་འོད་ཟེར་དང་། མྱུར་བའི་འོད་ཟེར་དང་། ཤིན་ཏུ་མྱུར་བའི་འོད་ཟེར་དང་། གནས་པ་མ་མཆིས་པའི་འོད་ཟེར་དང་། གནས་མ་མཆིས་པའི་འོད་ཟེར་དང་། རབ་ཏུ་འབར་བའི་འོད་ཟེར་དང་། སྣང་བར་བགྱིད་པའི་འོད་ཟེར་དང་། མོས་པར་བགྱིད་པའི་འོད་ཟེར་དང་། ཕ་རོལ་དུ་ཕྱིན་པར་བགྱིད་པའི་འོད་ཟེར་དང་། ཐོགས་པ་མ་མཆིས་པའི་འོད་ཟེར་དང་། གཡོ་བ་མ་མཆིས་པའི་འོད་ཟེར་དང་། དྲང་པོའི་འོད་ཟེར་དང་། དཔག་ཏུ་མ་མཆིས་པ་ལ་གནས་པའི་འོད་ཟེར་དང་། གཟུགས་ཀྱི་མཚན་གྱི་འོད་ཟེར་དང་། གཟུགས་ཀྱི་མཚན་སྣ་ཚོགས་ཀྱི་འོད་ཟེར་དང་། གཟུགས་ཀྱི་མཚན་ཚད་མ་མཆིས་པའི་འོད་ཟེར་དང་། ཁ་དོག་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོའི་མཚན་ཉིད་ཀྱི་འོད་ཟེར་དང་། ཁ་དོག་ལེ་བརྒན་གྱི་མཚན་ཉིད་ཀྱི་འོད་ཟེར་དང་། ཆུ་ཤེལ་གྱི་ཁ་དོག་གི་མཚན་ཉིད་ཀྱི་འོད་ཟེར་དང་། ནམ་མཁའི་ཁ་དོག་གི་མཚན་ཉིད་ཀྱི་འོད་ཟེར་དང་། འདི་ལྟ་བུ་ལ་སོགས་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་འོད་ཟེར་རེ་རེ་ཀུན་ཀྱང་ཁ་དོག་རྣམ་པ་ལྔའི་འོད་ཟེར་འདྲེས་པར་གྱུར་པ་སྟོན་པར་མཛད་པ་ནས་ཁ་དོག་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོའི་དངོས་པོ་རེ་རེ་ཀུན་ཀྱང་འོད་ཟེར་ཁ་དོག་རྣམ་པ་སྣ་ཚོགས་ཚད་མ་མཆིས་པ་དཔག་ཏུ་མ་མཆིས་པ་དག་དང་འདྲེས་པར་གྱུར་པ་རབ་ཏུ་སྟོན་པར་མཛད་པའི་བར་དུ་བརྙེས་པར་གྱུར་ལགས།
en: With his palms respectfully joined together, he asked, “Blessed One, which activities did the Thus-Gone One previously perform to achieve his definitive light, magnetizing light, motivating light, manifesting light, multicolored light, single-colored light, narrow light, vast light, pure light, utterly pure light, stainless light, utterly stainless light, immaculate light, gradually expanding light, bright light, utterly bright light, boundless light, utterly boundless light, immeasurable light, utterly immeasurable light, unfathomable light, utterly unfathomable light, swift light, utterly swift light, nonabiding light, groundless light, blazing light, illuminating light, inspiring light, light that leads to perfection, unimpeded light, unwavering light, straight light, light that dwells within the infinite, light displaying the marks of form, light displaying the various marks of form, light displaying the immeasurable marks of form, light displaying the characteristics of blue, yellow, red, and white colors, light displaying the characteristics of violet color, light displaying the characteristics of crystalline color, light displaying the characteristics of the sky’s color, and other such lights? Each of those various lights is manifested mixed with light rays of five colors, and each of those blue, yellow, red, and white lights are manifested mixed with an infinite number of multicolored light rays.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: The Blessed One replied to Candraprabhakumārabhūta in verse: “I have achieved those various lights

source: ད་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི།
en: Since I have abandoned delusion

source: །དགེ་བའི་ལས་ཀྱི་རྒྱུ་རྐྱེན་གྱིས།
en: Through the causes and conditions

source: །རྨོངས་པ་རྣམས་ནི་རབ་སྤངས་པས། །འོད་ཟེར་སྣ་ཚོགས་གྲུབ་པ་ཡིན།
en: Of inconceivable virtuous actions. “Furthermore, I dwell on the path of the buddhas

source: །གཞན་ཡང་སྤྱོད་པ་སྣ་ཚོགས་ཀྱིས། །སངས་རྒྱས་ལམ་ལ་རབ་གནས་ཤིང་།
en: Through a variety of practices, And I manifest those mixed lights

source: །སྟོང་བ་བྱེད་མེད་ཤེས་རབ་ཀྱིས། །འདྲེས་པའི་འོད་ཟེར་བསྟན་པ་ཡིན།
en: Through the insight of emptiness and nonaction.

source: །ཇི་ལྟར་ཕྱི་རོལ་ཆོས་དག་ལ། །མཚན་ཉིད་བྱེ་བྲག་སྣ་ཚོགས་སྣང་།
en: “Although external phenomena

source: །དེ་ནི་སྟོང་ཞིང་བདག་ཀྱང་མེད།
en: Are empty and selfless,

source: །བྱེད་པ་མེད་ཅིང་སེམས་ཡིད་མེད།
en: Beyond actions and thoughts, They appear with various particular characteristics.

source: །གཞན་ཡང་ཇི་ལྟར་ནང་གི་ལུས།
en: “The inner body is also

source: །སྟོང་ཞིང་བདག་མེད་བྱེད་མེད་ཀྱང་།
en: Empty, selfless, and beyond action,

source: །དེ་ལས་རྣམ་པ་སྣ་ཚོགས་ཀྱི།
en: And yet all kinds of sounds

source: །སྒྲ་སྐད་དག་ནི་རབ་ཏུ་སྟོན།
en: Manifest from it. “In the same way, I fulfill the wishes of beings

source: །དེ་ལྟར་བྱེད་མེད་དབང་གིས་ན།
en: In accordance with their inclinations,

source: །ཁ་དོག་དཔག་མེད་འོད་བསྟན་ནས།
en: By manifesting lights of countless colors

source: །མོས་པ་དག་ནི་ཇི་བཞིན་དུ། །རེ་བ་དག་ནི་སྐོང་བར་མཛད།
en: Through the power of nonaction.

source: །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི།
en: “Sometimes a single light ray

source: །ཁ་དོག་རྣམ་པ་གཉིས་བསྐྱེད་ནས།
en: Produces two colors, Each displaying

source: །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡི། །བྱེ་བྲག་ཡོད་པ་རབ་ཏུ་སྟོན།
en: Higher, middle, and lower beams.

source: །ཁ་དོག་རྣམ་པ་གསུམ་བསྐྱེད་ནས།
en: Produces three colors, Each displaying

source: །ཁ་དོག་རྣམ་པ་བཞི་བསྐྱེད་ནས།
en: Produces four colors, Each displaying

source: །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་ལྔ་འབྱུང་བ།
en: “Sometimes five colors manifest From a single light ray,

source: །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་།
en: Each displaying higher, middle, and lower beams;

source: །ལས་གཙང་ལས་ནི་སྐྱེས་པ་ཡིན།
en: This is the result of pure actions.

source: །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་དྲུག་འབྱུང་བ།
en: “Sometimes six colors manifest From a single light ray,

source: །ཐབས་མཁས་ལས་ནི་སྐྱེས་པ་ཡིན།
en: This is the result of skillful means.

source: །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་བདུན་འབྱུང་བ།
en: “Sometimes seven colors manifest From a single light ray,

source: །ལས་དགེ་ལས་ནི་སྐྱེས་པ་ཡིན།
en: This is the result of virtuous actions.

source: །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་བརྒྱད་འབྱུང་བ།
en: “Sometimes eight colors manifest From a single light ray,

source: །དགེ་བའི་ཆོས་ལས་སྐྱེས་པ་ཡིན།
en: This is the result of wholesome qualities.

source: །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་དགུ་འབྱུང་བ།
en: “Sometimes nine colors manifest From a single light ray,

source: །ཚོགས་དག་ལས་ནི་སྐྱེས་པ་ཡིན།
en: This is the result of the accumulations.

source: །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་བཅུ་འབྱུང་བ།
en: “Sometimes ten colors manifest From a single light ray,

source: །སྦྱིན་པ་ལས་ནི་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: This is the result of generosity.

source: །ཁ་དོག་ཉི་ཤུ་གང་འབྱུང་བ།
en: “Sometimes twenty colors manifest From a single light ray,

source: །ཚུལ་ཁྲིམས་བསྲུངས་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: This is the result of having guarded discipline.

source: །ཁ་དོག་སུམ་ཅུ་གང་བྱུང་བ།
en: “Sometimes thirty colors manifest From a single light ray,

source: །བཟོད་པ་ལས་ནི་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: This is the result of patience.

source: །ཁ་དོག་བཞི་བཅུ་གང་བྱུང་བ།
en: “Sometimes forty colors manifest From a single light ray,

source: །བརྩོན་འགྲུས་ལས་ནི་སྐྱེས་པ་ཡིན།
en: This is the result of diligence.

source: །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་ལྔ་བཅུ་གང་འབྱུང་བ།
en: “Sometimes fifty colors manifest From a single light ray,

source: །བསམ་གཏན་ལས་ནི་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: This is the result of concentration.

source: །ཁ་དོག་དྲུག་བཅུ་གང་འབྱུང་བ།
en: “Sometimes sixty colors manifest From a single light ray,

source: །ཤེས་རབ་ལས་ནི་སྐྱེས་པ་ཡིན།
en: This is the result of insight.

source: །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བདུན་ཅུ་གང་འབྱུང་བ།
en: “Sometimes seventy colors manifest From a single light ray,

source: །བྱམས་སེམས་ལས་ནི་སྐྱེས་པ་ཡིན།
en: This is the result of love.

source: །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བརྒྱད་ཅུ་གང་འབྱུང་བ།
en: “Sometimes eighty colors manifest From a single light ray,

source: །སྙིང་རྗེའི་སེམས་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: This is the result of compassion.

source: །ཁ་དོག་དགུ་བཅུ་གང་འབྱུང་བ།
en: “Sometimes ninety colors manifest From a single light ray,

source: །དགའ་བའི་སེམས་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: This is the result of joy.

source: །ཁ་དོག་རྣམ་བརྒྱ་གང་འབྱུང་བ།
en: “Sometimes a hundred colors manifest From a single light ray,

source: །བཏང་སྙོམས་སེམས་ལས་སྐྱེས་པ་ཡིན།
en: This is the result of equanimity.

source: །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: “Sometimes a thousand colors manifest

source: །ཁ་དོག་སྟོང་ནི་གང་འབྱུང་བ།
en: From a single light ray,

source: །ཡོན་ཏན་སྟོན་ལས་སྐྱེས་པ་ཡིན།
en: This is the result of the display of qualities.

source: །ཁ་དོག་ཁྲི་ནི་གང་འབྱུང་བ།
en: From a single light ray,

source: །བསོད་ནམས་ཚོགས་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: This is the result of the accumulation of merit.

source: །ཁ་དོག་བྱེ་བ་གང་སྟོན་པ།
en: “Sometimes ten million colors manifest From a single light ray,

source: །ཡིད་ཆེས་པ་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: This is the result of trust.

source: །ཁ་དོག་བྱེ་བ་གཉིས་སྟོན་པ།
en: “Sometimes twenty million colors manifest From a single light ray,

source: །རྗེས་སུ་ཡི་རང་ལས་སྐྱེས་ཡིན།
en: This is the result of rejoicing.

source: །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་གསུམ་སྟོན་པ།
en: “Sometimes thirty million colors manifest From a single light ray,

source: །ཤིན་ཏུ་སྦྱངས་ལས་སྐྱེས་པ་ཡིན།
en: This is the result of pliancy.

source: །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་བཞི་སྟོན་པ།
en: “Sometimes forty million colors manifest From a single light ray,

source: །སངས་རྒྱས་གུས་ལས་སྐྱེས་པ་ཡིན།
en: This is the result of reverence toward the Buddha.

source: །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་ལྔ་སྟོན་པ།
en: “Sometimes fifty million colors manifest From a single light ray,

source: །ཆོས་ལ་གུས་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: This is the result of reverence toward the Dharma.

source: །ཁ་དོག་བྱེ་བ་དྲུག་སྟོན་པ།
en: “Sometimes sixty million colors manifest From a single light ray,

source: །དགེ་འདུན་གུས་ལས་སྐྱེས་པ་ཡིན།
en: This is the result of reverence toward the Saṅgha.

source: །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་བདུན་སྟོན་པ།
en: “Sometimes seventy million colors manifest From a single light ray,

source: །ཚུལ་ཁྲིམས་གུས་ལས་སྐྱེས་པ་ཡིན།
en: This is the result of respect for discipline.

source: །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་བརྒྱད་སྟོན་པ།
en: “Sometimes eighty million colors manifest From a single light ray,

source: །ཏིང་འཛིན་གུས་ལས་སྐྱེས་པ་ཡིན།
en: This is the result of respect for concentration.

source: །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་དགུ་སྟོན་པ།
en: “Sometimes ninety million colors manifest From a single light ray,

source: །ཀུན་བརྩེ་ལས་ནི་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི།
en: This is the result of affection toward everyone.

source: །ཁ་དོག་བྱེ་བ་བཅུ་སྟོན་པ།
en: “Sometimes a hundred million colors manifest From a single light ray,

source: །བག་ཡོད་ལས་ནི་སྐྱེས་པ་ཡིན།
en: This is the result of carefulness.

source: །གཞན་ཡང་སྤུ་ཁུང་གཅིག་ལས་ནི། །འོད་ཟེར་མང་པོ་གང་སྟོན་པ།
en: “Furthermore, many light rays radiate From a single pore;

source: །འོད་ཟེར་སྣ་ཚོགས་མིང་དེ་དག །དེང་འདིར་ཁྱོད་ལ་བཤད་པར་བྱ།
en: I should now tell you the names Of those various lights.

source: །ང་ལ་འོད་ཟེར་གཅིག་ཡོད་དེ།
en: “I have a light

source: །དེ་མིང་སྤྲིན་གཙང་སྣང་ཞེས་བྱ། །འོད་ཟེར་དེ་ནི་དགེ་བའི་རྩ།
en: Called illumination of pure clouds

source: །དཔག་མེད་བསགས་ལས་སྐྱེས་པ་ཡིན།
en: It arose from the accumulation Of boundless roots of virtue.

source: །འདི་ལྟར་འདས་པའི་དུས་ཀྱི་ཚེ།
en: “In the past, out of sympathy for all beings

source: །སེམས་ཅན་རྣམ་པ་ཇི་སྙེད་པ། །ནད་རྣམས་སྣ་ཚོགས་བཏབ་པ་ལས། །སྙིང་བརྩེའི་སེམས་ནི་རབ་བསྐྱེད་ནས།
en: Afflicted by various forms of diseases,

source: །སྨན་ནི་མང་པོ་རབ་བཏང་ཞིང་།
en: I gave them many kinds of medicine and restored their health;

source: །དེ་དག་སོས་པར་བྱས་པ་ཡི། །རྒྱུ་དང་རྐྱེན་ནི་འདི་ཡི་ཕྱིར། །དེ་འདྲའི་འོད་ཟེར་ཐོབ་པ་ཡིན།
en: I achieved that light through such causes and conditions.

source: །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ།
en: “I have another light

source: །དེ་མིང་རྣམ་དག་མིག་ཅེས་བྱ།
en: Called pure eye ; It arose by offering

source: །མར་མེས་སངས་རྒྱས་མཆོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: Lamps to the buddhas.

source: །དེ་མིང་རྣམ་དག་རྣ་ཞེས་བྱ།
en: Called pure ear

source: །སྒྲ་དབྱངས་དག་གིས་མཆོད་བྱས་པས།
en: It arose by offering them

source: །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: Melodious tunes.

source: །དེ་མིང་རྣམ་དག་སྣ་ཞེས་བྱ།
en: Called pure nose

source: །སྤོས་ཆུ་དག་གིས་མཆོད་བྱས་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by offering them Perfumed water.

source: །དེ་མིང་རྣམ་དག་ལྕེ་ཞེས་བྱ།
en: Called pure tongue

source: །རོ་མཆོག་དག་གིས་མཆོད་བྱས་པས།
en: It arose by offering them

source: །དེ་མིང་རྣམ་དག་ལུས་ཤེས་བྱ།
en: Called pure body

source: །འདི་ལྟར་གོས་ཀྱིས་མཆོད་བྱས་པས།
en: It arose by offering them

source: །དེ་མིང་རྣམ་དག་སེམས་ཞེས་བྱ།
en: Called pure mind

source: །རྟག་ཏུ་སངས་རྒྱས་ཡིད་ཆེས་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by continuously Trusting the buddhas.

source: །དེ་མིང་རྣམ་དག་གཟུགས་ཞེས་བྱ།
en: Called pure form

source: །སངས་རྒྱས་གཟུགས་ནི་བྲིས་པས་ན།
en: It arose by painting

source: །དེ་མིང་རྣམ་དག་སྒྲ་ཞེས་བྱ།
en: Called pure sound

source: །རྟག་ཏུ་ཆོས་ལ་བསྔགས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by continuously Praising the Dharma.

source: །དེ་མིང་རྣམ་དག་དྲི་ཞེས་བྱ། །རྟག་ཏུ་དགེ་འདུན་གུས་པས་ན།
en: Called pure scent

source: །དེ་མིང་རྣམ་དག་རོ་ཞེས་བྱ།
en: Called pure taste

source: །ཡིད་བཞིན་དུ་ནི་སྦྱིན་བཏང་བས།
en: It arose by practicing generosity

source: །དེ་མིང་རྣམ་དག་རེག་ཅེས་བྱ། །བྱུག་སྤོས་དག་གིས་མཆོད་པས་ན།
en: Called pure touch

source: །དེ་མིང་རྣམ་དག་ཆོས་ཞེས་བྱ། །ཆོས་རྣམས་ཡོངས་སུ་བཟུང་བས་ན།
en: Called pure phenomena

source: །དེ་མིང་རྣམ་དག་ས་ཞེས་བྱ།
en: Called pure earth ; It arose by sweeping the ground

source: །སངས་རྒྱས་དགེ་འདུན་ས་ཕྱགས་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: For the Buddha and the Saṅgha.

source: །དེ་མིང་རྣམ་དག་ཆུ་ཞེས་བྱ། །ཆུ་མིག་ཁྲོན་པས་མཆོད་པས་ན།
en: Called pure water

source: །དེ་མིང་རྣམ་དག་མེ་ཞེས་བྱ།
en: Called pure fire

source: །མི་འཛིན་མཆོད་ཅིང་སྦྱིན་བཏང་བས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by carrying fire And offering it.

source: །དེ་མིང་རྣམ་དག་རླུང་ཞེས་བྱ།
en: Called pure air

source: །རླུང་ཡབ་ཐོགས་ནས་མཆོད་པས་ན།
en: It arose through the offering

source: །དེ་མིང་རྣམ་དག་ཕུང་ཞེས་བྱ།
en: Called pure aggregates ; It arose by offering

source: །ལུས་ཀྱིས་སངས་རྒྱས་མཆོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: My body to the buddhas.

source: །དེ་མིང་རྣམ་དག་ཁམས་ཞེས་བྱ།
en: Called pure element

source: །རྟག་ཏུ་བྱམས་པའི་སེམས་བསྒོམས་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by continuously Cultivating love.

source: །དེ་མིང་རྣམ་དག་བདེན་ཞེས་བྱ།
en: Called pure truth

source: །རྟག་ཏུ་བརྫུན་ནི་སྤངས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by permanently Giving up lying.

source: །དེ་མིང་རྣམ་དག་ཞི་ཞེས་བྱ།
en: Called pure peace

source: །རྟག་ཏུ་སྦྱིན་པ་བཏང་བས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by continuously Practicing generosity.

source: །སངས་རྒྱས་རྣམས་ཀྱི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of the buddhas.

source: །དེ་མིང་རྣམ་དག་དྲན་ཞེས་བྱ། །ཏིང་འཛིན་བསྔགས་པ་བརྗོད་པས་ན།
en: Called pure recollection

source: །དེ་མིང་རྣམ་དག་སྤོབས་ཞེས་བྱ། །ཀུན་འཛིན་བསྔགས་པ་བརྗོད་པས་ན།
en: Called pure eloquence

source: །དེ་མིང་འཐུན་ཞེས་བྱ་བ་ཡིན།
en: Called harmony

source: །རྩོད་པ་དག་ནི་བསྡུམས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by settling Conflicts.

source: །དེ་མིང་དོན་རབ་བསྟན་ཅེས་བྱ།
en: Called revealing the meaning

source: །སྟོང་ཉིད་རབ་ཏུ་རྟོགས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by realizing Emptiness.

source: །དེ་མིང་ཁ་དོག་སྔོ་ཞེས་བྱ། །པད་མ་སྔོན་པོས་མཆོད་པས་ན།
en: Called blue color

source: །དེ་མིང་ཁ་དོག་སེར་ཞེས་བྱ།
en: Called yellow color

source: །ཙམ་པ་ཀས་ནི་མཆོད་པས་ན།
en: It arose by offering

source: །དེ་མིང་ཁ་དོག་དམར་ཞེས་བྱ། །མུ་ཏིག་དག་གིས་མཆོད་པས་ན།
en: Called red color

source: །དེ་མིང་ཁ་དོག་དཀར་ཞེས་བྱ།
en: Called white color ; It arose by offering

source: །གསེར་གྱི་གདུགས་ཀྱིས་མཆོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: Golden parasols.

source: །དེ་མིང་ཡོན་ཏན་མཆོག་ཅེས་བྱ།
en: Called supreme qualities ; It arose by adorning the buddhas

source: །ཚོན་སྣ་མང་པོས་བརྒྱན་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: With many types of colors.

source: །དེ་མིང་ཀླུའི་གཟི་ཞེས་བྱ། །ཀླུ་ཡི་བ་དན་གྱིས་མཆོད་པས།
en: Called nāga splendor

source: །དེ་མིང་གླང་པོའི་གཟི་ཞེས་བྱ།
en: Called elephant splendor

source: །གླང་པོའི་བ་དན་གྱིས་མཆོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by offering Elephant flags.

source: །དེ་མིང་སེང་གེ་རྒྱལ་ཞེས་བྱ། །སེང་གེའི་བ་དན་གྱིས་མཆོད་པས།
en: Called king of lions

source: །དེ་མིང་ཁྱུ་མཆོག་རྒྱལ་ཞེས་བྱ།
en: Called king of bulls

source: །ཁྱུ་མཆོག་བ་དན་གྱིས་མཆོད་པས།
en: It arose by offering

source: །དེ་མིང་རྣམ་དག་ཟླ་བ་ཡིན། །སངས་རྒྱས་མཆོད་རྟེན་ཕྱགས་པས་ན།
en: Called pure moon

source: །དེ་མིང་ཀླུ་གདུལ་ཞེས་བྱའོ། །དར་གྱི་ལྡ་ལྡི་ཕུལ་བས་ན།
en: Called taming the nāgas

source: །དེ་མིང་གནོད་སྦྱིན་འདུལ་ཞེས་བྱ། །སོ་སོར་ལེགས་པར་བརྟགས་པས་ན།
en: Called taming the yakṣas

source: །དེ་མིང་བུད་མེད་རྟོགས་ཞེས་བྱ།
en: Called understanding women ; It arose by abandoning

source: །བུད་མེད་མཚན་མ་སྤངས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The features of women.

source: །དེ་མིང་སྐྱེས་པ་རྟོགས་ཞེས་བྱ།
en: Called understanding men

source: །སྐྱེས་པའི་མཚན་མ་སྤངས་པས་ན།
en: It arose by abandoning

source: །དེ་མིང་རྡོ་རྗེ་སྟོབས་ཞེས་བྱ།
en: Called vajra strength ; It arose through

source: །ལས་ཀྱི་ཤེས་པ་དག་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: Pure knowledge of actions.

source: །དེ་མིང་སྟོང་པ་སྟོན་ཞེས་བྱ།
en: Called revealing emptiness

source: །འཇིག་རྟེན་རྣམ་སྨིན་སྟོན་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by teaching Karmic ripening to the world.

source: །དེ་མིང་ཡང་དག་རྟོགས་ཞེས་བྱ།
en: Called true realization

source: །ཕྱིན་ཅི་ལོག་ནི་སྤངས་པས་ན།
en: It arose by abandoning

source: །སངས་རྒྱས་གསུང་ནི་སྟོན་ཞེས་བྱ། །ཆོས་དབྱིངས་བསྔགས་པ་བརྗོད་པས་ན།
en: Called revealing the Buddha’s words

source: །སྐྱོན་རྣམས་སྤངས་པ་ཞེས་བྱའོ།
en: Called abandonment of faults; It arose by proclaiming

source: །མོས་པའི་བསྔགས་པ་བརྗོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of devotion.

source: །བཀོད་པ་ཀུན་ཏུ་སྣང་ཞེས་བྱ།
en: Called illuminating array ; It arose by proclaiming

source: །མར་མེ་ཕུལ་བའི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of offering lamps.

source: །དེ་མིང་སྲེད་པ་སྤངས་ཞེས་བྱ། །ཏིང་འཛིན་ཤེས་རབ་བསྔགས་བརྗོད་པས།
en: Called abandonment of craving

source: །དེ་མིང་བག་ཆགས་སྤངས་ཞེས་བྱ།
en: Called abandonment of habitual patterns

source: །སྔོན་མཐའི་ཤེས་པ་སྤངས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by abandoning The knowledge of the past.

source: །དེ་མིང་ཆགས་པ་སྤངས་ཞེས་བྱ།
en: Called abandonment of attachment

source: །མི་སྐྱེ་ཡེ་ཤེས་བསྔགས་པས་ན།
en: It arose by praising

source: །འགྲོ་བ་རྣམས་ནི་སྤངས་ཞེས་བྱ། །ཟག་ཟད་ཡེ་ཤེས་བསྔགས་པས་ན།
en: Called abandonment of transmigration

source: །དེ་མིང་གནས་སྤངས་ཞེས་བྱ་སྟེ།
en: Called abandonment of dwelling place

source: །སྡུག་བསྔལ་ཤེས་པ་བསྔགས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by praising The knowledge of suffering.

source: །སངས་རྒྱས་ཆོ་འཕྲུལ་ཞེས་བྱའོ།
en: Called miraculous display of the Buddha ; It arose by proclaiming

source: །རྫུ་འཕྲུལ་མཐུ་ཡི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of miraculous power.

source: །དེ་མིང་གཟུགས་མེད་སྟོན་ཅེས་བྱ།
en: Called revealing the nonexistence of name-and-form ; It arose by proclaiming

source: །རྫུ་འཕྲུལ་རྐང་གི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of the bases of miraculous power.

source: །དགེ་བའི་གྲོགས་ལ་མོས་ཞེས་བྱ།
en: Called devotion to virtuous friends

source: །རྟོགས་པའི་རང་བཞིན་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by proclaiming The praises of the nature of realization.

source: །མིག་གི་སྔོན་མཐའ་ཞེས་བྱའོ།
en: Called past limit of the eye

source: །མིག་གི་སྔོན་མཐའ་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by proclaiming The praises of the past limit of the eye.

source: །མིག་གི་མཐའ་ཟད་ཅེས་བྱའོ།
en: Called limit of the exhaustion of the eye ; It arose by proclaiming

source: །མིག་ཟད་བསྔགས་པ་བརྗོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of the exhaustion of the eye.

source: །དེ་མིང་སྲིད་པའི་མཐའ་ཞེས་བྱ།
en: Called limit of existence ; It arose by proclaiming

source: །སྲིད་མེད་བསྔགས་པ་བརྗོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of the absence of existence.

source: །དེ་མིང་འཇིག་པ་མེད་ཅེས་བྱ།
en: Called absence of disintegration ; It arose by proclaiming

source: །འགོག་པ་མེད་ཀྱི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of the absence of cessation.

source: །དེ་མིང་མཐའ་མེད་ཅེས་བྱའོ།
en: Called absence of limits ; It arose by proclaiming

source: །མཐའ་མེད་བསྔགས་པ་བརྗོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of the absence of limits.

source: །དེ་མིང་མཚན་མ་མེད་ཅེས་བྱ།
en: Called absence of marks ; It arose by proclaiming

source: །འདུས་མ་བྱས་ཀྱི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of the unconditioned.

source: །དེ་མིང་འགྱུར་བ་མེད་ཅེས་བྱ།
en: Called unchanging

source: །ཁྱད་པར་མེད་པའི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by proclaiming The praises of the absence of distinction.

source: །ཞེན་པ་མེད་པའི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of the absence of clinging.

source: །དེ་མིང་འབྱུང་བ་མེད་ཅེས་བྱ།
en: Called absence of origination ; It arose by proclaiming

source: །སྐྱེ་བ་མེད་པའི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: The praises of the unborn.

source: །དེ་མིང་སྐྱེ་བ་མེད་ཅེས་བྱ།
en: Called absence of birth

source: །འབྱུང་བ་མེད་པའི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན།
en: It arose by proclaiming The praises of the lack of origination.

source: །ང་ལ་འོད་ཟེར་བསྟན་མེད་ཅེས་བྱ་ཡོད།
en: “I have a light called undefinable

source: །སྐྱེ་དགུ་རྣམས་ནི་ཡོངས་སུ་སྨིན་པར་བྱེད།
en: That ripens all beings.

source: །ང་ལ་འོད་ཟེར་ཆོས་ཉིད་ཅེས་བྱ་ཡོད།
en: I have a light called reality

source: །སངས་རྒྱས་ཞིང་ནི་བྱེ་བ་གཡོ་བར་བྱེད།
en: That shakes ten million buddha realms.

source: །ང་ལ་འོད་ཟེར་བདུད་འདུལ་ཞེས་བྱ་ཡོད།
en: “I have a light called taming demons

source: །འོད་ཟེར་དེ་ཡི་གཟིས་ནི་བདུད་སྐྲག་བྱེད།
en: Whose brilliance terrorizes demons.

source: །ང་ལ་འོད་ཟེར་བསོད་ནམས་རྒྱལ་མཚན་ཡོད།
en: I have a light called banner of merit

source: །དེ་ཡི་མིང་འཛིན་དག་ནི་གནོད་པ་སྤོང་།
en: Those who remember its name will abandon harm.
